#汇总 生成输入X数据
#手动保存 
#顺序 正方形（1-2500） 正方形空 （2500-5000） 三角形 （5000-7500）三角形中空 （7500-10000） 
#     圆形（10000-12500）圆形中空（12500-15000）五角星（15000-17500）五角星中空 （17500-20000）
#    八边形 （20000-22500）八边形中空（22500-25000）

a = [1,0,0,0,0,0,0,0,0,0] #正方形
b = [0,1,0,0,0,0,0,0,0,0] #正方形中空
c = [0,0,1,0,0,0,0,0,0,0] #三角形
d = [0,0,0,1,0,0,0,0,0,0] #三角形中空
e = [0,0,0,0,1,0,0,0,0,0] #圆形
f = [0,0,0,0,0,1,0,0,0,0] #圆形中空
g = [0,0,0,0,0,0,1,0,0,0] #五角星
h = [0,0,0,0,0,0,0,1,0,0] #五角星中空
i = [0,0,0,0,0,0,0,0,1,0] #八边形
j = [0,0,0,0,0,0,0,0,0,1] #八边形中空
v = "Y"
matrix = [a,b,c,d,e,f,g,h,i,j]
for number in range(len(matrix)):
    file = open(("230109神经网络数据/%s.txt" %v),'a')
    for i in range(2500):
        s = str(matrix[number]).replace('[','').replace(']','')
        file.write(s)
        file.write(',')
        file.write('\n')
    print("保存文件成功") 

file.close()